In [1]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bicycle/seoul_bi.csv')
df.head()

         대여일자  대여시간  대여소번호 대여구분코드 성별 연령대코드  이용건수    운동량   탄소량     이동거리  사용시간
0  2021-06-01     0   3541    정기권  F  ~10대     1   0.00  0.00     0.00     8
1  2021-06-01     0    765    정기권  F  ~10대     1  27.21  0.35  1526.81    19
2  2021-06-01     0   2637    정기권  F  ~10대     1  41.40  0.37  1608.56    18
3  2021-06-01     0   2919    정기권  F  ~10대     1   0.00  0.00     0.00    75
4  2021-06-01     0    549    정기권  F  ~10대     1  13.04  0.17   731.55     6

In [25]:
res = df.groupby('대여일자').size().to_frame(name='대여일자')
res.index.name = None
display(res)
res[res['대여일자'] == res['대여일자'].max()].index[0]

             대여일자
2021-06-01  48081
2021-06-02  56100
2021-06-03  18985
2021-06-04  56788
2021-06-05  52730
2021-06-06  47787
2021-06-07  52623
2021-06-08  55623
2021-06-09  54507
2021-06-10  36992
2021-06-11  52089
2021-06-12  48569
2021-06-13  43131
2021-06-14  54945

'2021-06-04'

In [42]:
df['day_name'] = pd.to_datetime(df['대여일자']).dt.day_name()

df['day_name'].value_counts().to_frame().rename_axis(None).rename(columns={'count': 'day_name'})

           day_name
Wednesday    110607
Friday       108877
Monday       107568
Tuesday      103704
Saturday     101299
Sunday        90918
Thursday      55977

In [64]:
res = df.groupby(['day_name','대여소번호']).size().to_frame('size').sort_values(['day_name','size'], ascending=False).reset_index()
res.drop_duplicates('day_name').reset_index(drop=True)

# reset_index 두 번? => 다중 인덱스를 단일 인덱스로 변환해줘야 중복 처리가 가능함

    day_name  대여소번호  size
0  Wednesday    502   282
1    Tuesday    502   267
2   Thursday   2715   137
3     Sunday    502   372
4   Saturday    502   378
5     Monday    502   242
6     Friday    502   277

In [85]:
# 일일
day = df[df['대여구분코드'].isin(['일일권','일일권(비회원)'])].연령대코드.value_counts()
# 연령
age = df['연령대코드'].value_counts().sort_index()

display((day/age).sort_values(ascending=False))
(day/age).sort_values(ascending=False).index[0]

연령대코드
~10대    0.312525
20대     0.239913
30대     0.166702
40대     0.110585
50대     0.065414
70대~    0.048962
60대     0.042462
Name: count, dtype: float64

'~10대'

In [88]:
df[['연령대코드','이동거리']].groupby('연령대코드').mean()

              이동거리
연령대코드
20대    3211.890552
30대    3341.443859
40대    3514.857416
50대    3593.668100
60대    3538.145737
70대~   3085.039641
~10대   2634.426279

In [98]:
df20 = df[df['연령대코드']=='20대']
df_mean = df20[df20['이동거리'] >= df20['이동거리'].mean()]
# df_mean['탄소량'] #-> object타입
df_mean['탄소량'] = df_mean['탄소량'].astype('float')
round(df_mean.sort_values(['대여일자','대여소번호'],ascending=False).iloc[:200].탄소량.mean(),3)

C:\Users\leeyj\AppData\Local\Temp\ipykernel_9948\1348244661.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_mean['탄소량'] = df_mean['탄소량'].astype('float')

np.float64(1.613)

In [105]:
df['대여일자'] = pd.to_datetime(df['대여일자'])
df[(df['연령대코드'] == '~10대') & (df['대여일자'] == '2021-06-07')].이용건수.median()

np.float64(1.0)

In [111]:
# 시간
day = df[(df.day_name.isin(['Tuesday', 'Wednesday', 'Thursday', 'Friday','Monday'])) & (df.대여시간.isin([6,7,8]))]
#데이터 프레임 형태로 
res = day.groupby(['대여시간','대여소번호']).size().to_frame('이용 횟수')

res.sort_values(['대여시간','이용 횟수'], ascending=False).groupby('대여시간').head(3)

            이용 횟수
대여시간 대여소번호
8    2701     119
     646      115
     1152      92
7    259      104
     230       77
     726       77
6    2744      45
     1125      40
     1028      36

In [114]:
df[df['이동거리'] > df['이동거리'].mean()].이동거리.std()

np.float64(5092.139707505356)

In [122]:
df['sex'] = df['성별'].map(lambda x:'남' if x in ['m','M'] else '여')
df[['sex','이동거리']].groupby('sex').mean()

            이동거리
sex
남    3209.110871
여    3468.575025